#include <iostream>

using namespace std;

void main()
{
	// 변수 선언
	// 출력, 입력하는법
	// if문
	// 난수설정하는법

	// 변수 네이밍 규칙
	// 
	// 영어로 my name이라는 글자를 변수로 작성하고싶다.
	// 
	// 1번 카멜케이스
	int myName; 

	// 2번 스네이크케이스
	int my_name;

	// 3번 파스칼케이스
	int MyName;

	// 4번 헝가리안케이스
	// 맨앞에 자료형이 뭔지까지 붙여주는 케이스
	int iMyName;
	int m_ImyName;

	// 변수명에 자료형까지 내포하는 자료형
	iMyName = 0;

	// 헝가리안케이스 << 옛날엔 다들 이거로 사용했습니다.
	// 옛날에는 메모장으로 코딩했습니다.

	// 마우스만 올려도 이제 자료형이 나오기때문에 
	// 굳이 표기법이 기괴한 헝가리안표기법은 사용하지 않음.


	// 뭐로하셔도 상관은없는데
	// 자기 코드내에서 그 룰을 끝까지 지켜야해요.

	// 네이밍 컨벤션이 생긴이유는
	// 회사에서 많은 프로그래머들이 들어왔다가 나가기도할텐데
	// 그럼에도 불구하고 한명이 짠것처럼 보이게 하려고 하는 장치중에 하나
	// 한명이 짠것처럼보여야 코드가 정갈해집니다.

}