#include <iostream>

using namespace std;

void main()
{
	printf("Hello World\n");

	// 프로그래밍을 배우기전에 꼭 알아야하는 내용

	// 프로그래밍을 어느정도 마스터할때까지는 Visual Studio 를 사용합니다.
	// Visual Studio에 대해 알아야해요.

	// Visual Studio 단축키
	// Ctrl + Space : 인텔리전스 불러오기
	//		pri 적은후에 Ctrl + Space 해보기
	// 드래그한 상태 +  (Ctrl + K) + C :  주석 
	// 드래그한 상태 +  (Ctrl + K) + U :  주석 풀기
	// Ctrl + Shift + F : 검색
	// Ctrl + , : 코드 검색

	// Ctrl + F5 : 디버깅하지않고 시작
	// F5 : 디버깅으로 시작

	// 프로그래밍을 할때 꼭 지켜야하는 내용 (C++)
	// 프로그래밍은 항상 괄호가 시작하면 괄호를 닫아줘야합니다.
	//  [어떤내용이던 상관없음]  
	//	{어떤내용이던 상관없음}
	//  (어떤내용이던 상관없음)
	//  "어떤내용이던 상관없음"
	//  '어떤내용이던 상관없음'
	//  <어떤내용이던 상관없음>
	//  => [ ( ] )     (x)
	//  => [ ( ) ]     (o)
	//  => {[ ( ) ]}   (o)
	//   이거는 안돼요.

}

// => 주석 (코멘트)
// 초록색글자는 프로그램에 아무런 영향을 안끼쳐요.
// 
//#include <iostream> 
// include  포함한다 . (iostream) 에 대한 내용
//  iostream >> input, output에대한 stream 정보를담고있는 곳
// input => 입력 (사용자 키보드 입력) (마우스입력)
// output => 화면에 출력하는것들 (글자출력)

// using namespace std;
// 아직 사용안하는데 나중에 많이쓸거라, 미리 계속 적어두는 느낌

// void main() {}
// >> 모든 프로그램은 "main" 이라는 실행점을 찾아서 실행합니다.
//  콘솔만그런게아니라 "모든 프로그램" 입니다.


// 언어
// 영어, 일본어
// 처음에는 다외우져
// 프로그래밍도 처음에는 다외워야해요.
// 저희가 한달만에 C++을 끝낼거에요.
// 그러다보니까 외울량이 좀많아요.
// 3개월정도간은 잘외우는사람이 잘할수밖에 없는 구조